In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['w','x','y','z']

In [3]:
list = [10,20,30,40]

In [4]:
array = np.array([10,20,30,40])

In [5]:
dict = {'w':10,'x':20,'y':30,'z':40}

In [6]:
pd.Series(data=list)

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
pd.Series(data=list, index=labels)

w    10
x    20
y    30
z    40
dtype: int64

In [8]:
pd.Series(list,labels)

w    10
x    20
y    30
z    40
dtype: int64

In [9]:
pd.Series(array)

0    10
1    20
2    30
3    40
dtype: int32

In [10]:
pd.Series(array,labels)

w    10
x    20
y    30
z    40
dtype: int32

In [11]:
pd.Series(dict)

w    10
x    20
y    30
z    40
dtype: int64

In [12]:
sports1 = pd.Series([1,2,3,4],index = ['Cricket', 'Football','Basketball', 'Golf'])

In [13]:
sports1

Cricket       1
Football      2
Basketball    3
Golf          4
dtype: int64

In [14]:
sports1['Cricket']

1

In [15]:
sports1[0]

1

In [16]:
sports2 = pd.Series([1,2,5,4],index = ['Cricket', 'Football','Baseball', 'Golf'])

In [17]:
sports1 + sports2

Baseball      NaN
Basketball    NaN
Cricket       2.0
Football      4.0
Golf          8.0
dtype: float64

In [18]:
from numpy.random import randn

In [19]:
np.random.seed(1)

In [20]:
dataframe = pd.DataFrame(randn(10,5),index='A B C D E F G H I J'.split(),
                         columns='Score1 Score2 Score3 Score4 Score5'.split())

In [21]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [22]:
dataframe['Score3']

A   -0.528172
B   -0.761207
C   -0.322417
D   -0.877858
E    0.901591
F   -0.935769
G   -0.687173
H    0.234416
I   -0.747158
J    2.100255
Name: Score3, dtype: float64

In [23]:
dataframe[['Score2','Score1']]

     Score2    Score1
A -0.611756  1.624345
B  1.744812 -2.301539
C -2.060141  1.462108
D -0.172428 -1.099891
E  1.144724 -1.100619
F -0.122890 -0.683728
G -0.396754 -0.691661
H -1.117310 -0.012665
I -0.887629 -0.191836
J  0.190915 -0.636996

In [24]:
dataframe['Score6'] = dataframe['Score1'] + dataframe['Score2']

In [25]:
dataframe

     Score1    Score2    Score3    Score4    Score5    Score6
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408  1.012589
B -2.301539  1.744812 -0.761207  0.319039 -0.249370 -0.556727
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769 -0.598033
D -1.099891 -0.172428 -0.877858  0.042214  0.582815 -1.272319
E -1.100619  1.144724  0.901591  0.502494  0.900856  0.044105
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355 -0.806618
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246 -1.088414
H -0.012665 -1.117310  0.234416  1.659802  0.742044 -1.129975
I -0.191836 -0.887629 -0.747158  1.692455  0.050808 -1.079465
J -0.636996  0.190915  2.100255  0.120159  0.617203 -0.446080

In [26]:
dataframe.drop('Score6',axis=1, inplace=True)

In [27]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [28]:
dataframe.drop('A',axis=0)

     Score1    Score2    Score3    Score4    Score5
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [29]:
dataframe.loc['F']

Score1   -0.683728
Score2   -0.122890
Score3   -0.935769
Score4   -0.267888
Score5    0.530355
Name: F, dtype: float64

In [30]:
dataframe.iloc[2]

Score1    1.462108
Score2   -2.060141
Score3   -0.322417
Score4   -0.384054
Score5    1.133769
Name: C, dtype: float64

In [31]:
dataframe.loc['A','Score1']

1.6243453636632417

In [32]:
dataframe.loc[['A','B'],['Score1','Score2']]

     Score1    Score2
A  1.624345 -0.611756
B -2.301539  1.744812

In [33]:
dataframe>0.5

   Score1  Score2  Score3  Score4  Score5
A    True   False   False   False    True
B   False    True   False   False   False
C    True   False   False   False    True
D   False   False   False   False    True
E   False    True    True    True    True
F   False   False   False   False    True
G   False   False   False   False   False
H   False   False   False    True    True
I   False   False   False    True   False
J   False   False    True   False    True

In [34]:
dataframe[dataframe>0.5]

     Score1    Score2    Score3    Score4    Score5
A  1.624345       NaN       NaN       NaN  0.865408
B       NaN  1.744812       NaN       NaN       NaN
C  1.462108       NaN       NaN       NaN  1.133769
D       NaN       NaN       NaN       NaN  0.582815
E       NaN  1.144724  0.901591  0.502494  0.900856
F       NaN       NaN       NaN       NaN  0.530355
G       NaN       NaN       NaN       NaN       NaN
H       NaN       NaN       NaN  1.659802  0.742044
I       NaN       NaN       NaN  1.692455       NaN
J       NaN       NaN  2.100255       NaN  0.617203

In [35]:
dataframe[dataframe['Score1']>0.5]

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769

In [36]:
dataframe[dataframe['Score1']>0.5]['Score2']

A   -0.611756
C   -2.060141
Name: Score2, dtype: float64

In [37]:
dataframe[dataframe['Score1']>0.5][['Score2','Score3']]

     Score2    Score3
A -0.611756 -0.528172
C -2.060141 -0.322417

In [38]:
dataframe[(dataframe['Score1']>0.5) & (dataframe['Score2'] > 0)]

Empty DataFrame
Columns: [Score1, Score2, Score3, Score4, Score5]
Index: []

In [39]:
dataframe

     Score1    Score2    Score3    Score4    Score5
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
B -2.301539  1.744812 -0.761207  0.319039 -0.249370
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
D -1.099891 -0.172428 -0.877858  0.042214  0.582815
E -1.100619  1.144724  0.901591  0.502494  0.900856
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
H -0.012665 -1.117310  0.234416  1.659802  0.742044
I -0.191836 -0.887629 -0.747158  1.692455  0.050808
J -0.636996  0.190915  2.100255  0.120159  0.617203

In [40]:
dataframe.reset_index()

  index    Score1    Score2    Score3    Score4    Score5
0     A  1.624345 -0.611756 -0.528172 -1.072969  0.865408
1     B -2.301539  1.744812 -0.761207  0.319039 -0.249370
2     C  1.462108 -2.060141 -0.322417 -0.384054  1.133769
3     D -1.099891 -0.172428 -0.877858  0.042214  0.582815
4     E -1.100619  1.144724  0.901591  0.502494  0.900856
5     F -0.683728 -0.122890 -0.935769 -0.267888  0.530355
6     G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
7     H -0.012665 -1.117310  0.234416  1.659802  0.742044
8     I -0.191836 -0.887629 -0.747158  1.692455  0.050808
9     J -0.636996  0.190915  2.100255  0.120159  0.617203

In [41]:
newindex = 'IND JP CAN GE IT PL FY IU RT IP'.split()

In [42]:
dataframe['Countries'] = newindex

In [43]:
dataframe

     Score1    Score2    Score3    Score4    Score5 Countries
A  1.624345 -0.611756 -0.528172 -1.072969  0.865408       IND
B -2.301539  1.744812 -0.761207  0.319039 -0.249370        JP
C  1.462108 -2.060141 -0.322417 -0.384054  1.133769       CAN
D -1.099891 -0.172428 -0.877858  0.042214  0.582815        GE
E -1.100619  1.144724  0.901591  0.502494  0.900856        IT
F -0.683728 -0.122890 -0.935769 -0.267888  0.530355        PL
G -0.691661 -0.396754 -0.687173 -0.845206 -0.671246        FY
H -0.012665 -1.117310  0.234416  1.659802  0.742044        IU
I -0.191836 -0.887629 -0.747158  1.692455  0.050808        RT
J -0.636996  0.190915  2.100255  0.120159  0.617203        IP

In [44]:
dataframe.set_index('Countries' , inplace=True)

In [45]:
dataframe

             Score1    Score2    Score3    Score4    Score5
Countries
IND        1.624345 -0.611756 -0.528172 -1.072969  0.865408
JP        -2.301539  1.744812 -0.761207  0.319039 -0.249370
CAN        1.462108 -2.060141 -0.322417 -0.384054  1.133769
GE        -1.099891 -0.172428 -0.877858  0.042214  0.582815
IT        -1.100619  1.144724  0.901591  0.502494  0.900856
PL        -0.683728 -0.122890 -0.935769 -0.267888  0.530355
FY        -0.691661 -0.396754 -0.687173 -0.845206 -0.671246
IU        -0.012665 -1.117310  0.234416  1.659802  0.742044
RT        -0.191836 -0.887629 -0.747158  1.692455  0.050808
IP        -0.636996  0.190915  2.100255  0.120159  0.617203

In [46]:
dataframe = pd.DataFrame({'Cricket':[1,2,np.nan,4,6,7,2,np.nan],
                  'Baseball':[5,np.nan,np.nan,5,7,2,4,5],
                  'Tennis':[1,2,3,4,5,6,7,8]})

In [47]:
dataframe

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       NaN       2
2      NaN       NaN       3
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      NaN       5.0       8

In [48]:
dataframe.dropna()

   Cricket  Baseball  Tennis
0      1.0       5.0       1
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7

In [49]:
dataframe.dropna(axis=1)

   Tennis
0       1
1       2
2       3
3       4
4       5
5       6
6       7
7       8

In [50]:
dataframe.dropna(thresh=1)

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       NaN       2
2      NaN       NaN       3
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      NaN       5.0       8

In [51]:
dataframe.fillna(value=0)

   Cricket  Baseball  Tennis
0      1.0       5.0       1
1      2.0       0.0       2
2      0.0       0.0       3
3      4.0       5.0       4
4      6.0       7.0       5
5      7.0       2.0       6
6      2.0       4.0       7
7      0.0       5.0       8

In [52]:
dataframe['Baseball'].fillna(value=4.6667)

0    5.0000
1    4.6667
2    4.6667
3    5.0000
4    7.0000
5    2.0000
6    4.0000
7    5.0000
Name: Baseball, dtype: float64

In [53]:
dataframe['Baseball'].mean()

4.666666666666667

In [54]:
dat = {'CustID':['1001','1001','1002','1002','1003','1003'],
       'CustName':['UIPat','DatRob','Goog','Chrysler','Ford','GM'],
       'Profitinlakhs':[2005,3245,1245,8765,5463,3547]}

In [55]:
dat

{'CustID': ['1001', '1001', '1002', '1002', '1003', '1003'],
 'CustName': ['UIPat', 'DatRob', 'Goog', 'Chrysler', 'Ford', 'GM'],
 'Profitinlakhs': [2005, 3245, 1245, 8765, 5463, 3547]}

In [56]:
dataframe = pd.DataFrame(dat)

In [57]:
dataframe

  CustID  CustName  Profitinlakhs
0   1001     UIPat           2005
1   1001    DatRob           3245
2   1002      Goog           1245
3   1002  Chrysler           8765
4   1003      Ford           5463
5   1003        GM           3547

In [58]:
grouped_CustID = dataframe.groupby('CustID')

In [59]:
grouped_CustID.mean()

        Profitinlakhs
CustID
1001             2625
1002             5005
1003             4505

In [60]:
grouped_CustID.describe().transpose()['1002']

Profitinlakhs  count       2.000000
               mean     5005.000000
               std      5317.442995
               min      1245.000000
               25%      3125.000000
               50%      5005.000000
               75%      6885.000000
               max      8765.000000
Name: 1002, dtype: float64

In [61]:
dafa1 = pd.DataFrame({'CustID': ['101', '102', '103', '104'],
                        'Sales': [13456, 45321, 54385, 53212],
                        'Priority': ['CAT0', 'CAT1', 'CAT2', 'CAT3'],
                        'Prime': ['yes', 'no', 'no', 'yes']},
                        index=['in1', 'in2', 'in3', 'in4'])

dafa2 = pd.DataFrame({'CustID': ['101', '103', '104', '105'],
                        'Sales': [13456, 54385, 53212, 4534],
                        'Payback': ['CAT4', 'CAT5', 'CAT6', 'CAT7'],
                        'Imp': ['yes', 'no', 'no', 'no']},
                         index=['in1', 'in3', 'in4', 'in5'])

In [62]:
pd.concat([dafa1,dafa2],axis=1)

D:\Installation\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

    CustID    Sales Priority Prime CustID    Sales Payback  Imp
in1    101  13456.0     CAT0   yes    101  13456.0    CAT4  yes
in2    102  45321.0     CAT1    no    NaN      NaN     NaN  NaN
in3    103  54385.0     CAT2    no    103  54385.0    CAT5   no
in4    104  53212.0     CAT3   yes    104  53212.0    CAT6   no
in5    NaN      NaN      NaN   NaN    105   4534.0    CAT7   no

In [63]:
pd.merge(dafa1,dafa2,how='left',on='CustID')

  CustID  Sales_x Priority Prime  Sales_y Payback  Imp
0    101    13456     CAT0   yes  13456.0    CAT4  yes
1    102    45321     CAT1    no      NaN     NaN  NaN
2    103    54385     CAT2    no  54385.0    CAT5   no
3    104    53212     CAT3   yes  53212.0    CAT6   no

In [64]:
dafa1

    CustID  Sales Priority Prime
in1    101  13456     CAT0   yes
in2    102  45321     CAT1    no
in3    103  54385     CAT2    no
in4    104  53212     CAT3   yes

In [65]:
dafa2

    CustID  Sales Payback  Imp
in1    101  13456    CAT4  yes
in3    103  54385    CAT5   no
in4    104  53212    CAT6   no
in5    105   4534    CAT7   no

In [66]:
dafa3 = pd.DataFrame({'Q1': ['101', '102', '103'],
                     'Q2': ['201', '202', '203']},
                      index=['I0', 'I1', 'I2']) 

dafa4 = pd.DataFrame({'Q3': ['301', '302', '303'],
                    'Q4': ['401', '402', '403']},
                      index=['I0', 'I2', 'I3'])

In [67]:
dafa3.join(dafa4, how='right')

     Q1   Q2   Q3   Q4
I0  101  201  301  401
I2  103  203  302  402
I3  NaN  NaN  303  403

In [68]:
dataframe = pd.DataFrame({'custID':[1,2,3,4],
                          'SaleType':['big',np.nan,'medium',np.nan],
                          'SalesCode':[np.nan,'131','141','151']})

In [69]:
dataframe

   custID SaleType SalesCode
0       1      big       NaN
1       2      NaN       131
2       3   medium       141
3       4      NaN       151

In [70]:
dataframe.head()

   custID SaleType SalesCode
0       1      big       NaN
1       2      NaN       131
2       3   medium       141
3       4      NaN       151

In [71]:
dataframe['SaleType'].value_counts()

big       1
medium    1
Name: SaleType, dtype: int64

In [72]:
newdataframe = dataframe[(dataframe['custID']!=3) & (dataframe['SaleType']=='big')]

In [73]:
newdataframe

   custID SaleType SalesCode
0       1      big       NaN

In [74]:
def profit(a):
    return a*4

In [75]:
dataframe['custID'].apply(profit)

0     4
1     8
2    12
3    16
Name: custID, dtype: int64

In [76]:
dataframe['custID'].sum()

10

In [77]:
del dataframe['custID']

In [78]:
dataframe

  SaleType SalesCode
0      big       NaN
1      NaN       131
2   medium       141
3      NaN       151

In [79]:
dataframe.index

RangeIndex(start=0, stop=4, step=1)

In [80]:
dataframe

  SaleType SalesCode
0      big       NaN
1      NaN       131
2   medium       141
3      NaN       151

In [81]:
dataframe.sort_values(by='SaleType')

  SaleType SalesCode
0      big       NaN
2   medium       141
1      NaN       131
3      NaN       151

In [82]:
dataframe.isnull()

   SaleType  SalesCode
0     False       True
1      True      False
2     False      False
3      True      False

In [83]:
dataframe.dropna()

  SaleType SalesCode
2   medium       141

In [84]:
dataframe

  SaleType SalesCode
0      big       NaN
1      NaN       131
2   medium       141
3      NaN       151

In [85]:
dataframe.fillna('Not nan', inplace=True)

In [86]:
dataframe

  SaleType SalesCode
0      big   Not nan
1  Not nan       131
2   medium       141
3  Not nan       151

In [87]:
dataframe.to_csv('titanic.csv',index=False)

In [88]:
dataframe

  SaleType SalesCode
0      big   Not nan
1  Not nan       131
2   medium       141
3  Not nan       151

In [89]:
dataframe.to_excel('Consumer2.xlsx',sheet_name='Sheet1')